singhanil2004/RL78_Kwh_Meter/rl78i1c/middleware/plugin/em_event_plugin.c
/***********************************************************************************************************************
* DISCLAIMER
* This software is supplied by Renesas Electronics Corporation and is only intended for use with Renesas products.
* No other uses are authorized. This software is owned by Renesas Electronics Corporation and is protected under all
* applicable laws, including copyright laws. 
* THIS SOFTWARE IS PROVIDED "AS IS" AND RENESAS MAKES NO WARRANTIESREGARDING THIS SOFTWARE, WHETHER EXPRESS, IMPLIED
* OR STATUTORY, INCLUDING BUT NOT LIMITED TO WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND
* NON-INFRINGEMENT.  ALL SUCH WARRANTIES ARE EXPRESSLY DISCLAIMED.TO THE MAXIMUM EXTENT PERMITTED NOT PROHIBITED BY
* LAW, NEITHER RENESAS ELECTRONICS CORPORATION NOR ANY OF ITS AFFILIATED COMPANIES SHALL BE LIABLE FOR ANY DIRECT,
* INDIRECT, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES FOR ANY REASON RELATED TO THIS SOFTWARE, EVEN IF RENESAS OR
* ITS AFFILIATES HAVE BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
* Renesas reserves the right, without notice, to make changes to this software and to discontinue the availability 
* of this software. By using this software, you agree to the additional terms and conditions found by accessing the 
* following link:
* http://www.renesas.com/disclaimer
*
* Copyright (C) 2013, 2015 Renesas Electronics Corporation. All rights reserved.
***********************************************************************************************************************/

/***********************************************************************************************************************
* File Name    : em_event_plugin.c
* Version      : 1.00
* Device(s)    : RL78/I1C
* Tool-Chain   : CCRL
* H/W Platform : RL78/I1C Energy Meter Platform
* Description  : EM Event Plugin
***********************************************************************************************************************/

/***********************************************************************************************************************
Includes   <System Includes> , "Project Includes"
***********************************************************************************************************************/
#include "em_event_adapter.h"                   /* EM Core Event Adapter Header */
#include "em_core.h"                            /* EM Core */

/***********************************************************************************************************************
Macro definitions
***********************************************************************************************************************/
#define EM_EXT_EVENT_APPEAR_COUNT               10      /* Appear times to check event occurred, recovered */

/***********************************************************************************************************************
Typedef definitions
***********************************************************************************************************************/

/***********************************************************************************************************************
Imported global variables and functions (from other files)
***********************************************************************************************************************/

/***********************************************************************************************************************
Exported global variables and functions (to be accessed by other files)
***********************************************************************************************************************/
EM_EXT_EVENT_RESULT EM_EXT_EVENT_Detection(void);

/***********************************************************************************************************************
Private global variables and functions
***********************************************************************************************************************/
static int8_t               stick_count  = 0;                       /* Stick Count */
static int8_t               noload_act_appear_count[3] = {0,0,0};           /* Active Noload Appear Count */
static int8_t               noload_rea_appear_count[3] = {0,0,0};           /* Reactive Noload Appear Count */
static int8_t               noload_app_appear_count[3] = {0,0,0};           /* Apparent Noload Appear Count */
static int8_t               peak_voltage_appear_count[3] = {0,0,0};         /* Peak Voltage Appear Count */
static int8_t               peak_current_appear_count[3] = {0,0,0};         /* Peak Current Appear Count */
static int8_t               freq_out_range_appear_count[3] = {0,0,0};       /* Frequency Out Range Appear Count */

/******************************************************************************
* Function Name: void EM_EXT_EVENT_ResetStickCount(void)                    
* Description  : Reset the stick count before sleep
* Arguments    : None
* Return Value : None
******************************************************************************/
void EM_EXT_EVENT_ResetStickCount(void)
{
    /* Reset the stick count */
    stick_count = 0;
    noload_act_appear_count[0] = \
    noload_act_appear_count[1] = \
    noload_act_appear_count[2] = \
    noload_rea_appear_count[0] = \
    noload_rea_appear_count[1] = \
    noload_rea_appear_count[2] = \
    noload_app_appear_count[0] = \
    noload_app_appear_count[1] = \
    noload_app_appear_count[2] = \
    peak_voltage_appear_count[0] = \
    peak_voltage_appear_count[1] = \
    peak_voltage_appear_count[2] = \
    peak_current_appear_count[0] = \
    peak_current_appear_count[1] = \
    peak_current_appear_count[2] = \
    freq_out_range_appear_count[0] = \
    freq_out_range_appear_count[1] = \
    freq_out_range_appear_count[2] = EM_EXT_EVENT_APPEAR_COUNT - 1;
}

/***********************************************************************************************************************
* Function Name: uint8_t EM_EXT_EVENT_RegisterPlugin(EM_EXT_CALLBACK cb_active_noload,                 
                                                     EM_EXT_CALLBACK cb_reactive_noload,               
                                                     EM_EXT_CALLBACK cb_apparent_noload,               
                                                     EM_EXT_EVENT_CALLBACK_MDM_CYCEND cb_max_demand,      
                                                     EM_EXT_EVENT_CALLBACK_MDM_CYCEND cb_tariff_changed,  
                                                     EM_EXT_EVENT_CALLBACK_ENERGY_CYCEND cb_energy_cycend,
                                                     EM_EXT_CALLBACK cb_peak_voltage,                     
                                                     EM_EXT_CALLBACK cb_peak_current,                     
                                                     EM_EXT_CALLBACK cb_freq_out_range,                   
                                                     EM_EXT_CALLBACK cb_sag_voltage);                     
* Description  : Register event plugin
* Arguments    : EM_EXT_CALLBACK cb_active_noload                     : Active Noload Callback
*              : EM_EXT_CALLBACK cb_reactive_noload                   : Reactive Noload Callback
*              : EM_EXT_CALLBACK cb_apparent_noload                   : Apparent Noload Callback
*              : EM_EXT_EVENT_CALLBACK_MDM_CYCEND cb_max_demand       : Max Demand Update End Callback
*              : EM_EXT_EVENT_CALLBACK_MDM_CYCEND cb_tariff_changed   : Tariff Changed Callback
*              : EM_EXT_EVENT_CALLBACK_ENERGY_CYCEND cb_energy_cycend : Energy Update End Callback
*              : EM_EXT_CALLBACK cb_peak_voltage                      : Peak Voltage Callback
*              : EM_EXT_CALLBACK cb_peak_current                      : Peak Current Callback
*              : EM_EXT_CALLBACK cb_freq_out_range                    : Frequency Out Of Range Callback
*              : EM_EXT_CALLBACK cb_sag_voltage                       : SAG (Low) voltage Callback
* Return Value : Execution status
*              : EM_EXT_OK      Success
*              : EM_EXT_ERROR   Error. Plugin registration is FAILED
***********************************************************************************************************************/
uint8_t EM_EXT_EVENT_RegisterPlugin(EM_EXT_CALLBACK cb_active_noload_R,                    /* Active Noload Callback */
                                    EM_EXT_CALLBACK cb_active_noload_Y,                    /* Active Noload Callback */
                                    EM_EXT_CALLBACK cb_active_noload_B,                    /* Active Noload Callback */
                                    EM_EXT_CALLBACK cb_reactive_noload_R,                  /* Reactive Noload Callback */
                                    EM_EXT_CALLBACK cb_reactive_noload_Y,                  /* Reactive Noload Callback */
                                    EM_EXT_CALLBACK cb_reactive_noload_B,                  /* Reactive Noload Callback */
                                    EM_EXT_CALLBACK cb_apparent_noload_R,                  /* Apparent Noload Callback */
                                    EM_EXT_CALLBACK cb_apparent_noload_Y,                  /* Apparent Noload Callback */
                                    EM_EXT_CALLBACK cb_apparent_noload_B,                  /* Apparent Noload Callback */
                                    EM_EXT_CALLBACK cb_peak_voltage_R,                     /* Peak Voltage Callback */
                                    EM_EXT_CALLBACK cb_peak_voltage_Y,                     /* Peak Voltage Callback */
                                    EM_EXT_CALLBACK cb_peak_voltage_B,                     /* Peak Voltage Callback */
                                    EM_EXT_CALLBACK cb_peak_current_R,                     /* Peak Current Callback */
                                    EM_EXT_CALLBACK cb_peak_current_Y,                     /* Peak Current Callback */
                                    EM_EXT_CALLBACK cb_peak_current_B,                     /* Peak Current Callback */
                                    EM_EXT_CALLBACK cb_freq_out_range_R,                   /* Frequency Out Of Range Callback */
                                    EM_EXT_CALLBACK cb_freq_out_range_Y,                   /* Frequency Out Of Range Callback */
                                    EM_EXT_CALLBACK cb_freq_out_range_B,                   /* Frequency Out Of Range Callback */
                                    EM_EXT_CALLBACK cb_sag_voltage_R,                       /* SAG (Low) voltage Callback */
                                    EM_EXT_CALLBACK cb_sag_voltage_Y,                       /* SAG (Low) voltage Callback */
                                    EM_EXT_CALLBACK cb_sag_voltage_B,                       /* SAG (Low) voltage Callback */
                                    EM_EXT_CALLBACK cb_swell_voltage_R,                     /* SWELL (High) voltage Callback */
                                    EM_EXT_CALLBACK cb_swell_voltage_Y,                     /* SWELL (High) voltage Callback */
                                    EM_EXT_CALLBACK cb_swell_voltage_B,                     /* SWELL (High) voltage Callback */
                                    EM_EXT_EVENT_CALLBACK_MDM_CYCEND cb_max_demand,        /* Max Demand Update End Callback */
                                    EM_EXT_EVENT_CALLBACK_TARIFF_CHANGE cb_tariff_changed, /* Tariff Changed Callback */
                                    EM_EXT_EVENT_CALLBACK_ENERGY_CYCEND cb_energy_cycend   /* Energy Update End Callback */
)
{
    EM_EXT_EVENT_PLUGIN_INFO plugin_info;
    
