singhanil2004/RL78_Kwh_Meter/rl78i1c/middleware/plugin/em_event_plugin.c
    /* Initial setting */
    plugin_info.fp_detection           = EM_EXT_EVENT_Detection;
    
    plugin_info.fp_cb_active_noload_R    = cb_active_noload_R  ;
    plugin_info.fp_cb_active_noload_Y    = cb_active_noload_Y  ;
    plugin_info.fp_cb_active_noload_B    = cb_active_noload_B  ;
    plugin_info.fp_cb_reactive_noload_R  = cb_reactive_noload_R;
    plugin_info.fp_cb_reactive_noload_Y  = cb_reactive_noload_Y;
    plugin_info.fp_cb_reactive_noload_B  = cb_reactive_noload_B;
    plugin_info.fp_cb_apparent_noload_R  = cb_apparent_noload_R;
    plugin_info.fp_cb_apparent_noload_Y  = cb_apparent_noload_Y;
    plugin_info.fp_cb_apparent_noload_B  = cb_apparent_noload_B;
    plugin_info.fp_cb_peak_voltage_R     = cb_peak_voltage_R   ;
    plugin_info.fp_cb_peak_voltage_Y     = cb_peak_voltage_Y   ;
    plugin_info.fp_cb_peak_voltage_B     = cb_peak_voltage_B   ;
    plugin_info.fp_cb_peak_current_R     = cb_peak_current_R   ;
    plugin_info.fp_cb_peak_current_Y     = cb_peak_current_Y   ;
    plugin_info.fp_cb_peak_current_B     = cb_peak_current_B   ;
    plugin_info.fp_cb_freq_out_range_R   = cb_freq_out_range_R ;
    plugin_info.fp_cb_freq_out_range_Y   = cb_freq_out_range_Y ;
    plugin_info.fp_cb_freq_out_range_B   = cb_freq_out_range_B ;
    plugin_info.fp_cb_sag_voltage_R      = cb_sag_voltage_R    ;
    plugin_info.fp_cb_sag_voltage_Y      = cb_sag_voltage_Y    ;
    plugin_info.fp_cb_sag_voltage_B      = cb_sag_voltage_B    ;
    plugin_info.fp_cb_swell_voltage_R    = cb_swell_voltage_R  ;
    plugin_info.fp_cb_swell_voltage_Y    = cb_swell_voltage_Y  ;
    plugin_info.fp_cb_swell_voltage_B    = cb_swell_voltage_B  ;

    plugin_info.fp_cb_mdm_end          = cb_max_demand     ;
    plugin_info.fp_cb_tariff_changed   = cb_tariff_changed ;
    plugin_info.fp_cb_energy_cycend    = cb_energy_cycend  ;
    /* Register to EM Core */
    return EM_EXT_EVENT_Register(&plugin_info);
}

/***********************************************************************************************************************
* Function Name: EM_EXT_EVENT_RESULT EM_EXT_EVENT_Detection(void)
* Description  : EM Event Detection API
*              : This API will be auto-called every 120ms (from EM Core)
* Arguments    : None
* Return Value : EM_EXT_EVENT_RESULT, event result
***********************************************************************************************************************/
EM_EXT_EVENT_RESULT EM_EXT_EVENT_Detection(void)
{   
    static EM_EXT_EVENT_RESULT  event_result = {0};                     /* Event result */

    EM_LINE                     phase_line;
    EM_CONFIG                   config;
    float32_t                   voltage, freq;

    /* Increase stick count */
    stick_count++;
    
    /* Get EM Core Configuration */
    config = EM_GetConfig();

    for(phase_line = LINE_PHASE_R; phase_line <= LINE_PHASE_B; phase_line ++)
    {
        /* Check active noload condition */
        if (EM_EXT_GetActivePowerSign(phase_line) == 0)
        {
            noload_act_appear_count[phase_line]++;
        }
        else
        {
            noload_act_appear_count[phase_line]--;
        }
        
        /* Check reactive noload condition */
        if (EM_EXT_GetReactivePowerSign(phase_line) == 0)
        {
            noload_rea_appear_count[phase_line]++;
        }
        else
        {
            noload_rea_appear_count[phase_line]--;
        }
        
        /* Check apparent noload condition */
        if (EM_EXT_GetApparentPowerSign(phase_line) == 0)
        {
            noload_app_appear_count[phase_line]++;
        }
        else
        {
            noload_app_appear_count[phase_line]--;
        }
        
        /* Check peak, sag voktage */
        voltage = EM_GetVoltageRMS(phase_line);
        if (voltage > (float32_t)config.voltage_high)
        {
            peak_voltage_appear_count[phase_line]++;
        }
        else
        {
            peak_voltage_appear_count[phase_line]--;    
        }
        
        /* Check peak current */
        if (EM_GetCurrentRMS(phase_line) > (float32_t)config.current_high)
        {
            peak_current_appear_count[phase_line]++;
        }
        else
        {
            peak_current_appear_count[phase_line]--;
        }
        
        /* Check frequency out range */
        freq = EM_GetLineFrequency(phase_line);
        if (freq < (float32_t)config.freq_low ||
            freq > (float32_t)config.freq_high)
        {
            freq_out_range_appear_count[phase_line]++;
        }
        else
        {
            freq_out_range_appear_count[phase_line]--;
        }
        
        /* Check active noload occurred, same as stick and reach max? */
        if (noload_act_appear_count[phase_line] == stick_count &&
            noload_act_appear_count[phase_line] >= (EM_EXT_EVENT_APPEAR_COUNT))
        {
            switch(phase_line)
            {
                case LINE_PHASE_R:
                    event_result.details.is_active_noload_R = 1;
                    break;
                case LINE_PHASE_Y:
                    event_result.details.is_active_noload_Y = 1;
                    break;
                case LINE_PHASE_B:
                    event_result.details.is_active_noload_B = 1;
                    break;
                default:
                    break;
            }
        }
        /* Check active noload recovered, same as stick and reach min?  */
        else if (   noload_act_appear_count[phase_line] == (-stick_count) &&
                    noload_act_appear_count[phase_line] <= (-EM_EXT_EVENT_APPEAR_COUNT))
        {
            switch(phase_line)
            {
                case LINE_PHASE_R:
                    event_result.details.is_active_noload_R = 0;
                    break;
                case LINE_PHASE_Y:
                    event_result.details.is_active_noload_Y = 0;
                    break;
                case LINE_PHASE_B:
                    event_result.details.is_active_noload_B = 0;
                    break;
                default:
                    break;
            }
        }
        
        /* Check reactive noload occurred, same as stick and reach max? */
        if (noload_rea_appear_count[phase_line] == stick_count &&
            noload_rea_appear_count[phase_line] >= (EM_EXT_EVENT_APPEAR_COUNT))
        {
            switch(phase_line)
            {
                case LINE_PHASE_R:
                    event_result.details.is_reactive_noload_R = 1;
                    break;
                case LINE_PHASE_Y:
                    event_result.details.is_reactive_noload_Y = 1;
                    break;
                case LINE_PHASE_B:
                    event_result.details.is_reactive_noload_B = 1;
                    break;
                default:
                    break;
            }
        }
        /* Check reactive noload recovered, same as stick and reach min?  */
        else if (   noload_rea_appear_count[phase_line] == (-stick_count) &&
                    noload_rea_appear_count[phase_line] <= (-EM_EXT_EVENT_APPEAR_COUNT))
        {
            switch(phase_line)
            {
                case LINE_PHASE_R:
                    event_result.details.is_reactive_noload_R = 0;
                    break;
                case LINE_PHASE_Y:
                    event_result.details.is_reactive_noload_Y = 0;
                    break;
                case LINE_PHASE_B:
                    event_result.details.is_reactive_noload_B = 0;
                    break;
                default:
                    break;
            }
        }
        
        /* Check apparent noload occurred, same as stick and reach max? */
        if (noload_app_appear_count[phase_line] == stick_count &&
            noload_app_appear_count[phase_line] >= (EM_EXT_EVENT_APPEAR_COUNT))
        {
            switch(phase_line)
            {
                case LINE_PHASE_R:
                    event_result.details.is_apparent_noload_R = 1;
                    break;
                case LINE_PHASE_Y:
                    event_result.details.is_apparent_noload_Y = 1;
                    break;
                case LINE_PHASE_B:
                    event_result.details.is_apparent_noload_B = 1;
                    break;
                default:
                    break;
            }
        }
        /* Check apparent noload recovered, same as stick and reach min?  */
        else if (   noload_app_appear_count[phase_line] == (-stick_count) &&
                    noload_app_appear_count[phase_line] <= (-EM_EXT_EVENT_APPEAR_COUNT))
        {
            switch(phase_line)
            {
                case LINE_PHASE_R:
                    event_result.details.is_apparent_noload_R = 0;
                    break;
                case LINE_PHASE_Y:
                    event_result.details.is_apparent_noload_Y = 0;
                    break;
                case LINE_PHASE_B:
                    event_result.details.is_apparent_noload_B = 0;
                    break;
                default:
                    break;
            }
        }
        /* Check peak current occurred, same as stick and reach max? */
        if (peak_current_appear_count[phase_line] == stick_count &&
            peak_current_appear_count[phase_line] >= (EM_EXT_EVENT_APPEAR_COUNT))
        {
            switch(phase_line)
            {
                case LINE_PHASE_R:
                    event_result.details.is_peak_current_R = 1;
                    break;
                case LINE_PHASE_Y:
                    event_result.details.is_peak_current_Y = 1;
                    break;
                case LINE_PHASE_B:
                    event_result.details.is_peak_current_B = 1;
                    break;
                default:
                    break;
            }
        }
        /* Check peak current recovered, same as stick and reach min?  */
        else if (   peak_current_appear_count[phase_line] == (-stick_count) &&
                    peak_current_appear_count[phase_line] <= (-EM_EXT_EVENT_APPEAR_COUNT))
        {
            switch(phase_line)
            {
                case LINE_PHASE_R:
                    event_result.details.is_peak_current_R = 0;
                    break;
                case LINE_PHASE_Y:
                    event_result.details.is_peak_current_Y = 0;
                    break;
                case LINE_PHASE_B:
                    event_result.details.is_peak_current_B = 0;
                    break;
                default:
                    break;
            }
        }
        
        /* Check peak voltage occurred, same as stick and reach max? */
        if (peak_voltage_appear_count[phase_line] == stick_count &&
            peak_voltage_appear_count[phase_line] >= (EM_EXT_EVENT_APPEAR_COUNT))
        {
            switch(phase_line)
            {
                case LINE_PHASE_R:
                    event_result.details.is_peak_voltage_R = 1;
                    break;
                case LINE_PHASE_Y:
                    event_result.details.is_peak_voltage_Y = 1;
                    break;
                case LINE_PHASE_B:
                    event_result.details.is_peak_voltage_B = 1;
                    break;
                default:
                    break;
            }
        }
        /* Check peak voltage recovered, same as stick and reach min?  */
        else if (   peak_voltage_appear_count[phase_line] == (-stick_count) &&
                    peak_voltage_appear_count[phase_line] <= (-EM_EXT_EVENT_APPEAR_COUNT))
        {
            switch(phase_line)
            {
                case LINE_PHASE_R:
                    event_result.details.is_peak_voltage_R = 0;
                    break;
                case LINE_PHASE_Y:
                    event_result.details.is_peak_voltage_Y = 0;
                    break;
                case LINE_PHASE_B:
                    event_result.details.is_peak_voltage_B = 0;
                    break;
                default:
                    break;
            }
        }
        
        /* Check freq out range occurred, same as stick and reach max? */
        if (freq_out_range_appear_count[phase_line] == stick_count &&
            freq_out_range_appear_count[phase_line] >= (EM_EXT_EVENT_APPEAR_COUNT))
        {
            switch(phase_line)
            {
                case LINE_PHASE_R:
                    event_result.details.is_freq_out_range_R = 1;
                    break;
                case LINE_PHASE_Y:
                    event_result.details.is_freq_out_range_Y = 1;
                    break;
                case LINE_PHASE_B:
                    event_result.details.is_freq_out_range_B = 1;
                    break;
                default:
                    break;
            }
        }
        /* Check freq out range recovered, same as stick and reach min?  */
        else if (   freq_out_range_appear_count[phase_line] == (-stick_count) &&
                    freq_out_range_appear_count[phase_line] <= (-EM_EXT_EVENT_APPEAR_COUNT))
        {
            switch(phase_line)
            {
                case LINE_PHASE_R:
                    event_result.details.is_freq_out_range_R = 0;
                    break;
                case LINE_PHASE_Y:
                    event_result.details.is_freq_out_range_Y = 0;
                    break;
                case LINE_PHASE_B:
                    event_result.details.is_freq_out_range_B = 0;
                    break;
                default:
                    break;
            }
        }
    }
    /* Stick count */
    if (stick_count >= EM_EXT_EVENT_APPEAR_COUNT)
    {
        noload_act_appear_count[0] = 0;
        noload_act_appear_count[1] = 0;
        noload_act_appear_count[2] = 0;
        noload_rea_appear_count[0] = 0;
        noload_rea_appear_count[1] = 0;
        noload_rea_appear_count[2] = 0;
        noload_app_appear_count[0] = 0;
        noload_app_appear_count[1] = 0;
        noload_app_appear_count[2] = 0;
        peak_voltage_appear_count[0] = 0;
        peak_voltage_appear_count[1] = 0;
        peak_voltage_appear_count[2] = 0;
        peak_current_appear_count[0] = 0;
        peak_current_appear_count[1] = 0;
        peak_current_appear_count[2] = 0;
        freq_out_range_appear_count[0] = 0;
        freq_out_range_appear_count[1] = 0;
        freq_out_range_appear_count[2] = 0;
        stick_count = 0;
    }
    
    /* Return tamper result */
    return event_result;
}
